🚧 [OpenTofu plan](https://opentofu.org) 🚧

```txt
module.region["lab01"].local_file.config: Refreshing state... [id=fa212a7f80425a2474fe73136d496e9f1846f4c0]
module.region["lab01"].data.talos_image_factory_versions.this: Reading...
module.region["lab01"].data.talos_image_factory_versions.this: Read complete after 0s [id=talos_versions]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.region["lab01"].local_file.version will be created
  + resource "local_file" "version" {
      + content              = "v1.9.3"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/home/runner/work/homelab/homelab/deploy/tofu/out/lab01"
      + id                   = (known after apply)
    }

  # module.region["lab01"].talos_machine_secrets.this will be created
  + resource "talos_machine_secrets" "this" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.9.3"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```